app/Controllers/usuario_controller.php

        public function formValidation() {

        $input =  $this->validate([

        'nombre' => 'required|min_length[3]',
        'apellido'=>'required|min_length[3]|max_length[25]',
        'usuario' =>'required|min_length[3]',
        'email'  => 'required|min_length[4]|max_length[100]|valid_email|is_unique[usuarios.email]',
        'pass'  =>  'required|min_length[3]|max_length[10]'
    ],
    );

   $formModel = new usuario_Model ();


if (!$input) {
            $data['titulo'] = 'registrar';
            echo view('front/head', $data);
            echo view('front/nav_bar');
            echo view('back/usuario/registrar', ['validation' => $this->validator]);
            echo view('front/footer');
}else {

        $formModel->save([
        'nombre' => $this->request->getVar('nombre'),
        'apellido' => $this->request->getVar('apellido'),
        'usuario' => $this->request->getVar('usuario'),
        'email' => $this->request->getVar('email'),
        'pass' => password_hash($this->request->getVar('pass'), PASSWORD_DEFAULT)]);
---
INSERT INTO `usuarios` (`nombre`, `apellido`, `usuario`, `email`, `pass`) VALUES ('ciro', 'martinez', 'ciro', 'ciro@gmail.com', '$2y$10$9/niizi7ty.aDSCRVTgBLOPUL3owG5zOA4JTkouL0QAoUt65uBKHW')